Amiya200/stm32_water_tank/Core/Src/model_handle.c
static bool suppressAutoOneCycle = false;
static uint32_t autoBootIgnoreUntil = 0;
#define AUTO_START_LEVEL_PERCENT   50
#define AUTO_STOP_LEVEL_PERCENT    100
static uint32_t loadTimer = 0;
static uint8_t  loadRetryCount = 0;
#ifndef EEPROM_PAGE_SIZE
#define EEPROM_PAGE_SIZE 32
#endif
#ifndef EEPROM_I2C_ADDR
#define EEPROM_I2C_ADDR (0x50 << 1)
#endif
#ifndef EEPROM_ADDR_SIZE
#define EEPROM_ADDR_SIZE I2C_MEMADD_SIZE_16BIT
#endif

typedef enum {
    SEMI_RUN_TEST = 0,
    SEMI_WAIT_GAP,
    SEMI_RUN_CONTINUOUS
} SemiState;

static SemiState semiState = SEMI_RUN_TEST;
static uint32_t  semiDeadline = 0;

static uint32_t semiWaterLossStart = 0;
static bool     semiWaterLossPending = false;

typedef struct __attribute__((packed))
{
    uint16_t sig;
    uint32_t gap;
    uint8_t  retry;
    uint16_t uv;
    uint16_t ov;
    uint16_t maxrun;
    uint16_t over10;
    uint16_t under10;
    uint16_t crc;
} SystemEEPROMBlock;
#define PROBE_THRESHOLD 0.30f
#define SENSOR_STABLE_TIME_MS 1500UL
#define EE_ADDR_SYS_BLOCK  0x0000
#define SYS_SIG 0x5A5A
static uint32_t autoWaterLossStart = 0;
static bool     autoWaterLossPending = false;

void EEPROM_WriteBlockSafe(uint16_t addr, uint8_t *data, uint16_t len)
{
    while (len)
    {
        uint16_t page_space = EEPROM_PAGE_SIZE - (addr % EEPROM_PAGE_SIZE);
        uint16_t chunk = (len < page_space) ? len : page_space;
        HAL_I2C_Mem_Write(&hi2c2, EEPROM_I2C_ADDR, addr,
                          EEPROM_ADDR_SIZE, data, chunk, 1000);
        HAL_Delay(6);
        addr += chunk;
        data += chunk;
        len  -= chunk;
    }
}
static uint16_t SYS_CRC16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFF;

    while (len--)
    {
        crc ^= *data++;
        for (uint8_t i = 0; i < 8; i++)
            crc = (crc & 1) ?
                  (crc >> 1) ^ 0xA001 :
                  (crc >> 1);
    }

    return crc;
}

void ModelHandle_SaveSettingsToEEPROM(void)
{
    SystemEEPROMBlock b;
    memset(&b, 0, sizeof(b));

    b.sig     = SYS_SIG;
    b.gap     = sys.gap_time_s;
    b.retry   = sys.retry_count;
    b.uv      = sys.uv_limit;
    b.ov      = sys.ov_limit;
    b.maxrun  = sys.maxrun_min;
    b.over10  = (uint16_t)(sys.overload * 10.0f);
    b.under10 = (uint16_t)(sys.underload * 10.0f);

    b.crc = SYS_CRC16((uint8_t*)&b, sizeof(b) - 2);

    EEPROM_WriteBlockSafe(EE_ADDR_SYS_BLOCK,
                          (uint8_t*)&b,
                          sizeof(b));
}

void ModelHandle_LoadSettingsFromEEPROM(void)
{
    SystemEEPROMBlock b;
    EEPROM_ReadBuffer(EE_ADDR_SYS_BLOCK,
                      (uint8_t*)&b,
                      sizeof(b));

    uint16_t crc = SYS_CRC16((uint8_t*)&b, sizeof(b) - 2);

    if (b.sig != SYS_SIG || crc != b.crc)
    {
        ModelHandle_SaveSettingsToEEPROM();
        return;
    }

    sys.gap_time_s  = b.gap;
    sys.retry_count = b.retry;
    sys.uv_limit    = b.uv;
    sys.ov_limit    = b.ov;
    sys.maxrun_min  = b.maxrun;
    sys.overload    = b.over10  / 10.0f;
    sys.underload   = b.under10 / 10.0f;
}

void ModelHandle_SaveModeState(void)
{
    modeState.manual_on          = manualActive;
    modeState.semi_on            = semiAutoActive;
    modeState.timer_on           = timerActive;
    modeState.countdown_on       = countdownActive;
    modeState.twist_on           = twistActive;
    modeState.auto_on            = autoActive;
    modeState.motor_on           = (motorStatus == 1);
    modeState.power_restore_mode = powerRestoreMode;

    EEPROM_WriteBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));
}
static void backup_current_mode(void)
{
    previousOwner     = motorOwner;
    previousManual    = manualActive;
    previousSemi      = semiAutoActive;
    previousCountdown = countdownActive;
    previousAuto      = autoActive;
}
static void restore_previous_mode(void)
{
    manualActive    = previousManual;
    semiAutoActive  = previousSemi;
    countdownActive = previousCountdown;
    autoActive      = previousAuto;

    if (previousManual)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (previousSemi)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (previousCountdown)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (previousAuto)
        motorOwner = MOTOR_OWNER_AUTO;
    else
    {
        motorOwner = MOTOR_OWNER_NONE;
        suppressAutoOneCycle = true;
        return;
    }
    if (!isTankFull() && isAnyModeActive())
    {
        start_motor();
    }
    else
    {
        stop_motor();
    }
}

void ModelHandle_StopRestart(void)
{
    if (!restartActive)
        return;
    restartActive = false;
    stop_motor();
    restore_previous_mode();
    ModelHandle_SaveModeState();
}

void ModelHandle_LoadModeState(void)
{
    EEPROM_ReadBuffer(0x0200, (uint8_t*)&modeState, sizeof(modeState));

    powerRestoreMode = modeState.power_restore_mode;
    if (powerRestoreMode > 2)
        powerRestoreMode = 0;

    /* --------------------------------------------------
       Power Restore Mode Handling
       0 = Restore Last State
       1 = Always OFF
       2 = Custom (LAST handled same as 0 here)
    ---------------------------------------------------*/

    if (powerRestoreMode == 1)   /* Always OFF */
    {
        manualActive    = false;
        semiAutoActive  = false;
        timerActive     = false;
        countdownActive = false;
        twistActive     = false;
        autoActive      = false;
        return;
    }

    /* Restore basic modes */
    manualActive    = modeState.manual_on;
    semiAutoActive  = modeState.semi_on;
    timerActive     = modeState.timer_on;
    countdownActive = modeState.countdown_on;
    twistActive     = modeState.twist_on;

    /* --------------------------------------------------
       AUTO MODE SAFE RESTORE
       Only restore AUTO if tank level <= 50%
    ---------------------------------------------------*/
    if (modeState.auto_on)
    {
        uint8_t level = ModelHandle_GetTankLevelPercent();

        if (level <= AUTO_START_LEVEL_PERCENT)   // 50%
        {
            autoActive = true;
        }
        else
        {
            autoActive = false;   // Prevent unwanted auto start
        }
    }
    else
    {
        autoActive = false;
    }
}

