Amiya200/stm32_water_tank/Core/Src/model_handle.c
bool ModelHandle_IsRestartActive(void)
{
    return restartActive;
}

static inline void motor_apply(bool on)
{
    if (timerActive && timerState == TIMER_STATE_OFF)
        on = false;
    bool relayNow = Motor_IsRelayOn();
    if (on)
    {
        if (!Motor_StartAllowed())
            return;
        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }
        motorStatus = 1;
    }
    else
    {
        if (relayNow)
            Relay_Set(1, false);
        motorStatus = 0;
    }
    UART_SendStatusPacket();
}

bool Motor_GetStatus(void)
{
    return Motor_IsRelayOn();
}
static inline void start_motor(void)
{
    uint32_t now = HAL_GetTick();
    if (now < bootStartBlockUntil)
       {
           return;
       }
    if (now < bootStartBlockUntil &&
        motorOwner != MOTOR_OWNER_MANUAL &&
        motorOwner != MOTOR_OWNER_SEMIAUTO &&
        motorOwner != MOTOR_OWNER_TIMER &&
        motorOwner != MOTOR_OWNER_COUNTDOWN &&
        motorOwner != MOTOR_OWNER_TWIST)
    {
        return;
    }
    if (motorOwner == MOTOR_OWNER_NONE)
        return;
    motor_apply(true);
}

static inline void stop_motor(void)
{
    motor_apply(false);
}
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus())
        return;
    if (countdownActive)
        return;
    if (restartActive);
    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;
    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        ModelHandle_SaveModeState();
        if (buzzerSettings.tankFullSound)
            Buzzer_StartEvent(BUZZ_TANK_FULL);

    }
}
void ModelHandle_CheckDryRun(void)
{
    if (manualActive)
    {
        senseDryRun = false;
        return;
    }
    float v = adcData.voltages[5];
    if (v < 0.01f)
        senseDryRun = true;
    else
        senseDryRun = false;
}
void ModelHandle_CheckGroundWater(void)
{
    float v = adcData.voltages[4];
    if (v < 0.01f)
        groundWater = true;
    else
        groundWater = false;
}
static inline bool isAnyModeActive(void)
{
    return (manualActive || semiAutoActive || countdownActive ||
            twistActive || timerActive || autoActive);
}
void ModelHandle_SoftDryRunHandler(void)
{
    if (countdownActive)
    {
        dryState = DRY_IDLE;
        return;
    }
    if (sys.gap_time_s == 0)
    {
        dryState = DRY_IDLE;
        return;
    }
    if (motorOwner != MOTOR_OWNER_TIMER)
    {
        dryState = DRY_IDLE;
        return;
    }
    uint32_t now   = HAL_GetTick();
    uint32_t gapMs = (uint32_t)sys.gap_time_s * 1000UL;
    ModelHandle_CheckDryRun();
    bool motorOn = Motor_GetStatus();
    if (motorOn)
    {
        if (senseDryRun == true)
        {
            dryState = DRY_IDLE;
            return;
        }
        if (dryState != DRY_WAITING)
        {
            dryState = DRY_WAITING;
            dryDeadline = now + gapMs;
        }
        if ((int32_t)(now - dryDeadline) >= 0)
        {
            stop_motor();
            dryState = DRY_FAULT;
            if (buzzerSettings.tankFullSound)
                Buzzer_StartEvent(BUZZ_TANK_FULL);
        }
    }
    else
    {
        if (dryState == DRY_FAULT && senseDryRun == true)
        {
            dryState = DRY_IDLE;
        }
    }
}
static inline uint32_t get_load_lock_duration_ms(void)
{
    if (sys.retry_count == 0)
        return LOAD_LOCK_DEFAULT_MS;
    return (uint32_t)sys.retry_count * 60000UL;
}

void ModelHandle_CheckLoadFault(void)
{
	if (!Motor_GetStatus())
        return;

    float I = g_currentA;
    float V = g_voltageV;
    bool overload  = (sys.overload  > 0.1f)   && (I > sys.overload);
    bool underload = (sys.underload > 0.001f) && (I < sys.underload);
    bool voltFault = ((sys.uv_limit && V < sys.uv_limit) ||
                      (sys.ov_limit && V > sys.ov_limit));
    senseOverLoad      = overload;
    senseUnderLoad     = underload;
    senseOverUnderVolt = voltFault;
    bool fault = overload || underload || voltFault;
    uint32_t now = HAL_GetTick();
    uint32_t lockMs = get_load_lock_duration_ms();
    switch (loadState)
    {
        case LOAD_NORMAL:
            loadRetryCount = 0;
            if (fault)
            {
                loadState = LOAD_FAULT_WAIT;
                loadTimer = now;
            }
            break;
        case LOAD_FAULT_WAIT:
            if (!fault)
            {
                loadState = LOAD_NORMAL;
            }
            else if ((now - loadTimer) >= LOAD_FAULT_CONFIRM_MS)
            {
                stop_motor();
                loadState = LOAD_FAULT_LOCK;
                loadTimer = now;
                if (buzzerSettings.tankFullSound)
                    Buzzer_StartEvent(BUZZ_TANK_FULL);
            }
            break;

        case LOAD_FAULT_LOCK:
            if (!fault)
            {
                loadState = LOAD_NORMAL;
            }
            else if ((now - loadTimer) >= lockMs && loadRetryCount < 1)
            {
                loadRetryCount++;

                if (isAnyModeActive())
                {
                    start_motor();
                }
                loadState = LOAD_RETRY_RUN;
                loadTimer = now;
            }
            break;
        case LOAD_RETRY_RUN:
            if ((now - loadTimer) >= LOAD_RETRY_RUN_MS)
            {
                if (fault)
                {
                    stop_motor();
                    loadState = LOAD_FAULT_LOCK;
                    loadTimer = now;
                    if (buzzerSettings.tankFullSound)
                        Buzzer_StartEvent(BUZZ_TANK_FULL);
                }
                else
                {
                    loadState = LOAD_NORMAL;
                    loadRetryCount = 0;
                }
            }
            break;
    }
}

static uint8_t get_today_mask(void)
{
    uint8_t d = time.dow;
    if (d < 1 || d > 7) d = 1;
    return (1U << (d - 1));
}
static bool slot_is_active_now(const TimerSlot *t)
{
    if (!t->enabled)
        return false;
    if (!(t->dayMask & get_today_mask()))
        return false;
    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;
    if (on == off)
        return false;
    if (on < off)
        return (now >= on && now < off);
    return (now >= on || now < off);
}

static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    return false;
}
static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;
    uint16_t now = time.hour * 60 + time.min;
    uint8_t  dm  = get_today_mask();
    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;
        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;
        bool active = (on < off) ?
                      (now >= on && now < off) :
                      (now >= on || now < off);
        if (active)
            return t->gapMinutes;
    }
    return 0;
}

void ModelHandle_SaveBuzzerSettings(void)
{
    EEPROM_WriteBuffer(EE_ADDR_BUZZER_BLOCK,
                       (uint8_t*)&buzzerSettings,
                       sizeof(buzzerSettings));
}
void ModelHandle_LoadBuzzerSettings(void)
{
    EEPROM_ReadBuffer(EE_ADDR_BUZZER_BLOCK,
                      (uint8_t*)&buzzerSettings,
                      sizeof(buzzerSettings));
}

void ModelHandle_ProcessTimerSlots(void)
{
    uint32_t now = HAL_GetTick();
    bool slotActive = timer_any_active_slot();
    if (!timerActive && slotActive)
    {
        backup_current_mode();
        clear_all_modes();
        senseMaxRunReached = false;
        timerActive = true;
        autoActive  = false;
        motorOwner  = MOTOR_OWNER_TIMER;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;
        start_motor();
    }
    if (timerActive && !slotActive)
    {
        stop_motor();
        timerActive = false;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;
        restore_previous_mode();
        ModelHandle_SaveModeState();
        return;
    }
    if (!timerActive)
        return;
    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        stop_motor();
        return;
    }
    uint16_t slotGap = get_active_timer_gap_minutes();
    uint16_t mainGap = sys.gap_time_s / 60;
    uint16_t appliedGapMin = (slotGap > 0) ? slotGap : mainGap;
    uint32_t gapMs = appliedGapMin * 60UL * 1000UL;
    if (gapMs == 0)
    {
        motorOwner = MOTOR_OWNER_TIMER;
        start_motor();
        return;
    }
    switch (timerState)
    {
        case TIMER_STATE_ON:
        {
            motorOwner = MOTOR_OWNER_TIMER;
            start_motor();
            if (timerStateDeadline == 0)
            {
                timerStateDeadline = now + gapMs;
            }
            if (now >= timerStateDeadline)
            {
                if (!senseDryRun)
                {
                    stop_motor();
                    timerState = TIMER_STATE_OFF;
                    timerStateDeadline = now + gapMs;
                }
                else
                {
                    timerStateDeadline = now + gapMs;
                }
            }
        }
        break;
        case TIMER_STATE_OFF:
        {
            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_ON;
                timerStateDeadline = 0;
            }
        }
        break;
        default:
        {
            timerState = TIMER_STATE_ON;
            timerStateDeadline = 0;
        }
        break;
    }
}

void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

