Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;
    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}

void ModelHandle_StartSemiAuto(void)
{
    restartActive = false;
    clear_all_modes();
    semiAutoActive = true;
    motorOwner     = MOTOR_OWNER_SEMIAUTO;
    semiState      = SEMI_RUN_TEST;
    semiDeadline   = 0;
    semiWaterLossPending = false;
    senseMaxRunReached = false;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint8_t retry)
{
    if (autoActive)
        return;
    clear_all_modes();
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;
    autoActive = true;
    autoState  = AUTO_ON_WAIT;
    uint32_t now = HAL_GetTick();
    uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
    autoRunStartMs = now;
    autoDeadline   = now + (gapSec * 1000UL);
    motorOwner = MOTOR_OWNER_AUTO;
}

void ModelHandle_StopAuto(void)
{
    stop_motor();
    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    autoDeadline = 0;
    ModelHandle_SaveModeState();
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
    if (auto_gap_s < 30 || auto_gap_s > 3600)
    {
        auto_gap_s = 120;
        EEPROM_WriteBlockSafe(0x0300,
                              (uint8_t*)&auto_gap_s,
                              sizeof(auto_gap_s));
    }
    if (auto_maxrun_min == 0xFFFF || auto_maxrun_min > 600)
    {
        auto_maxrun_min = 30;
        EEPROM_WriteBlockSafe(0x0302,
                              (uint8_t*)&auto_maxrun_min,
                              sizeof(auto_maxrun_min));
    }
    if (auto_retry_limit == 0xFF || auto_retry_limit > 20)
    {
        auto_retry_limit = 3;
        EEPROM_WriteBlockSafe(0x0304,
                              (uint8_t*)&auto_retry_limit,
                              sizeof(auto_retry_limit));
    }
}

static void auto_mode_background_control(void)
{
    if (!autoBackgroundEnabled)
        return;
    if (timerActive)
        return;
    uint32_t now = HAL_GetTick();
    if (now < bootBlockUntil)
        return;
    if (manualActive || semiAutoActive ||
        countdownActive || twistActive ||
        autoActive)
        return;
    uint8_t level = get_tank_level_percent();
    if (!autoActive &&
        level <= AUTO_START_LEVEL_PERCENT)
    {
    	ModelHandle_StartAuto(
    	    sys.gap_time_s,
    	    auto_maxrun_min,
    	    auto_retry_limit
    	);
    }
    if (autoActive &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
    }
}

static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = HAL_GetTick();
    uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
    uint32_t gapMs  = gapSec * 1000UL;

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    /* Stop conditions */
    if (isTankFull() || protectionFault)
    {
        ModelHandle_StopAuto();
        return;
    }

    switch (autoState)
    {
    /* =====================================================
       AUTO ON STATE
    ======================================================*/
    case AUTO_ON_WAIT:
    {
        /* Start motor if not running */
        if (!Motor_GetStatus())
        {
            motorOwner = MOTOR_OWNER_AUTO;
            start_motor();
            autoRunStartMs = now;   // track runtime start
            return;
        }

        /* If water NOT available */
        if (!groundWater || !senseDryRun)
        {
            /* If runtime exceeded */
            if ((now - autoRunStartMs) >= gapMs)
            {
                stop_motor();

                auto_retry_count++;

                if (auto_retry_count >= auto_retry_limit)
                {
                    ModelHandle_StopAuto();
                    return;
                }

                autoState = AUTO_OFF_WAIT;
                autoDeadline = now + gapMs;   // OFF wait time
            }
        }
        else
        {
            /* Water OK → reset runtime tracking */
            autoRunStartMs = now;
        }
    }
    break;

    /* =====================================================
       AUTO OFF STATE
    ======================================================*/
    case AUTO_OFF_WAIT:
    {
        stop_motor();

        if (now >= autoDeadline)
        {
            autoState = AUTO_ON_WAIT;
            autoRunStartMs = now;  // reset runtime
        }
    }
    break;

    default:
        autoState = AUTO_ON_WAIT;
        autoRunStartMs = now;
    break;
    }
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds == 0)
        return;
    clear_all_modes();
    senseMaxRunReached = false;
    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;
    motorOwner = MOTOR_OWNER_COUNTDOWN;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}

static void countdown_tick(void)
{
    if (!countdownActive)
        return;
    uint32_t now = now_ms();
    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }
    uint32_t remainingMs = cd_deadline - now;
    countdownDuration = remainingMs / 1000UL;
}

static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}

static void SaveCountdown(void)
{
    CountdownBlock b;
    memset(&b, 0, sizeof(b));
    b.sig = CD_SIGNATURE;
    b.active = countdownActive;
    if (countdownActive)
    {
        uint32_t now = now_ms();
        if (cd_deadline > now)
            b.remaining = (cd_deadline - now) / 1000UL;
        else
            b.remaining = 0;
    }
    else
    {
        b.remaining = 0;
    }
    b.crc = CD_CRC((uint8_t*)&b, sizeof(b)-2);
    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                       (uint8_t*)&b,
                       sizeof(b));
}
void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,
                      (uint8_t*)&b, sizeof(b));
    if (b.sig != CD_SIGNATURE)
        return;
    if (CD_CRC((uint8_t*)&b, sizeof(b)-2) != b.crc)
        return;
    if (b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline = now_ms() +
                      b.remaining * 1000UL;
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

static void twist_tick(void)
{
	if (!twistActive) return;
	    if (isTankFull())
	    {
	        ModelHandle_StopTwist();
	        if (buzzerSettings.tankFullSound)
	        return;
	    }
    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor();
    else stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (dryState == DRY_WAITING)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 400);
        LED_ApplyIntents();
        return;
    }
    if (dryState == DRY_FAULT)
    {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
        LED_ApplyIntents();
        return;
    }
    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);
    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}
uint32_t at = 0;
void ModelHandle_Process(void)
{
    uint32_t now = HAL_GetTick();
    at = now;
    if (modeSwitchPending)
    {
        if (now >= modeSwitchTime)
        {
            modeSwitchPending = false;
            motorOwner = pendingOwner;
        }
        return;
    }
    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();
    bool dryEnabled = (sys.gap_time_s > 0);
    dr =  dryEnabled;
    ModelHandle_CheckLoadFault();
    check_max_run();
    if (dryEnabled)
        ModelHandle_SoftDryRunHandler();
    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;
    ModelHandle_ProcessTimerSlots();
    if (restartActive)
        motorOwner = MOTOR_OWNER_RESTART;
    else if (timerActive)
        motorOwner = MOTOR_OWNER_TIMER;
    else if (manualActive)
        motorOwner = MOTOR_OWNER_MANUAL;
    else if (semiAutoActive)
        motorOwner = MOTOR_OWNER_SEMIAUTO;
    else if (countdownActive)
        motorOwner = MOTOR_OWNER_COUNTDOWN;
    else if (twistActive)
        motorOwner = MOTOR_OWNER_TWIST;
    else if (autoActive)
        motorOwner = MOTOR_OWNER_AUTO;
    else
        motorOwner = MOTOR_OWNER_NONE;
    if (Motor_GetStatus() && isTankFull())
    {
        if (!tankFullPendingStop)
        {
            tankFullPendingStop = true;
            tankFullDetectedAt = now;
        }
        if ((now - tankFullDetectedAt) >= TANK_FULL_DELAY_MS)
        {
            stop_motor();
            tankFullPendingStop = false;
        }
    }
    else
    {
        tankFullPendingStop = false;
    }
    static uint8_t prevLevel = 100;
    uint8_t currentLevel = get_tank_level_percent();

    if (currentLevel == 0 && prevLevel > 0)
    {
        if (buzzerSettings.tankEmptySound)
            Buzzer_StartEvent(BUZZ_TANK_EMPTY);
    }
    prevLevel = currentLevel;


