Amiya200/stm32_water_tank/Core/Src/model_handle.c
    switch (motorOwner)
    {
    case MOTOR_OWNER_RESTART:
    {
        uint32_t gapMs = dryEnabled ?
                         (uint32_t)sys.gap_time_s * 1000UL :
                         0;
        if (isTankFull())
        {
            ModelHandle_StopRestart();
            if (buzzerSettings.tankFullSound)
            break;
        }

        if (protectionFault)
        {
            stop_motor();
            if (dryEnabled)
            {
                restartState    = RESTART_WAIT_GAP;
                restartDeadline = now + gapMs;
            }
            break;
        }
        switch (restartState)
        {
        case RESTART_RUN_TEST:
        {
            start_motor();

            if (!dryEnabled || senseDryRun)
            {
                restartState = RESTART_RUN_CONTINUOUS;
                restartDeadline = 0;
                break;
            }
            if (restartDeadline == 0)
                restartDeadline = now + gapMs;
            if (dryEnabled && now >= restartDeadline)
            {
                stop_motor();
                restartState    = RESTART_WAIT_GAP;
                restartDeadline = now + gapMs;
            }
        }
        break;
        case RESTART_WAIT_GAP:
        {
            stop_motor();

            if (!dryEnabled || now >= restartDeadline)
            {
                restartState    = RESTART_RUN_TEST;
                restartDeadline = 0;
            }
        }
        break;
        case RESTART_RUN_CONTINUOUS:
        {
            start_motor();

            if (dryEnabled && !senseDryRun)
            {
                if (!restartWaterLossPending)
                {
                    restartWaterLossPending = true;
                    restartWaterLossStart   = now;
                }
                if ((now - restartWaterLossStart) >= RESTART_WATER_LOSS_CONFIRM_MS)
                {
                    stop_motor();
                    restartState    = RESTART_WAIT_GAP;
                    restartDeadline = now + gapMs;
                    restartWaterLossPending = false;
                }
            }
            else
            {
                restartWaterLossPending = false;
            }
        }
        break;

        default:
            restartState = RESTART_RUN_TEST;
            restartDeadline = 0;
        break;
        }
    }
    break;
    case MOTOR_OWNER_MANUAL:
        if (!protectionFault)
            start_motor();
        else
            stop_motor();
    break;
    case MOTOR_OWNER_SEMIAUTO:
    {
        uint32_t gapMs = dryEnabled ?
                         (uint32_t)sys.gap_time_s * 1000UL : 0;
        if (isTankFull())
        {
            if (!semiTankFullPendingStop)
            {
                semiTankFullPendingStop = true;
                semiTankFullDetectedAt = now;
            }
            if ((now - semiTankFullDetectedAt) >= SEMI_TANK_FULL_DELAY_MS)
            {
                stop_motor();
                semiAutoActive = false;
                motorOwner = MOTOR_OWNER_NONE;
                semiTankFullPendingStop = false;
                semiState = SEMI_RUN_TEST;
                ModelHandle_SaveModeState();
                if (buzzerSettings.tankFullSound)
                    Buzzer_StartEvent(BUZZ_TANK_FULL);
            }
            break;
        }
        else
        {
            semiTankFullPendingStop = false;
        }
        if (protectionFault)
        {
            stop_motor();
            if (dryEnabled)
            {
                semiState    = SEMI_WAIT_GAP;
                semiDeadline = now + gapMs;
            }
            break;
        }
        switch (semiState)
        {
        case SEMI_RUN_TEST:
        {
            if (!Motor_GetStatus())
            {
                start_motor();
                semiTestStartTime = now;
                semiWaterLossPending = false;
            }
            if (dryEnabled && (now - semiTestStartTime) >= gapMs)
            {
                if (senseDryRun)
                {
                    semiState = SEMI_RUN_CONTINUOUS;
                }
                else
                {
                    stop_motor();
                    semiState    = SEMI_WAIT_GAP;
                    semiDeadline = now + gapMs;
                }
            }
            if (!dryEnabled)
            {
                semiState = SEMI_RUN_CONTINUOUS;
            }
        }
        break;

        case SEMI_WAIT_GAP:
        {
            stop_motor();

            if (!dryEnabled || now >= semiDeadline)
                semiState = SEMI_RUN_TEST;
        }
        break;

        case SEMI_RUN_CONTINUOUS:
        {
            start_motor();

            if (dryEnabled && !senseDryRun)
            {
                if (!semiWaterLossPending)
                {
                    semiWaterLossPending = true;
                    semiWaterLossStart = now;
                }

                if ((now - semiWaterLossStart) >= gapMs)
                {
                    stop_motor();
                    semiState = SEMI_WAIT_GAP;
                    semiDeadline = now + gapMs;
                    semiWaterLossPending = false;
                }
            }
            else
            {
                semiWaterLossPending = false;
            }
        }
        break;

        default:
            semiState = SEMI_RUN_TEST;
        break;
        }
    }
    break;

    case MOTOR_OWNER_TIMER:
        if (protectionFault || isTankFull())
            stop_motor();
    break;
    case MOTOR_OWNER_COUNTDOWN:
    {
        uint32_t now = HAL_GetTick();
        uint32_t oneMinMs = 60000UL;

        /* Stop if expired */
        if (now >= cd_deadline)
        {
            ModelHandle_StopCountdown();
            break;
        }

        /* Stop if tank full or protection fault */
        if (isTankFull() || protectionFault)
        {
            ModelHandle_StopCountdown();
            break;
        }

        /* =========================================
           DRY MODE DISABLED
           → Run continuously
        ========================================= */
        if (!dryEnabled)
        {
            start_motor();
            countdown_tick();
            break;
        }

        /* =========================================
           DRY MODE ENABLED
        ========================================= */

        /* -------- WATER AVAILABLE -------- */
        if (senseDryRun)
        {
            start_motor();
            cdState = CD_RUN_CONTINUOUS;
            cdWaterLossPending = false;
        }
        else
        {
            /* -------- NO WATER -------- */
            switch (cdState)
            {
                case CD_RUN_TEST:
                {
                    if (!Motor_GetStatus())
                    {
                        start_motor();
                        cdTestStartTime = now;
                    }

                    if ((now - cdTestStartTime) >= oneMinMs)
                    {
                        stop_motor();
                        cdState = CD_WAIT_GAP;
                        cdGapDeadline = now + oneMinMs;
                    }
                }
                break;

                case CD_WAIT_GAP:
                {
                    stop_motor();

                    if (now >= cdGapDeadline)
                    {
                        cdState = CD_RUN_TEST;
                    }
                }
                break;

                case CD_RUN_CONTINUOUS:
                default:
                    cdState = CD_RUN_TEST;
                break;
            }
        }

        /* Always update countdown timer */
        countdown_tick();
    }
    break;

    case MOTOR_OWNER_TWIST:
        twist_tick();
    break;
    case MOTOR_OWNER_AUTO:
        auto_tick();
    break;
    default:
        stop_motor();
    break;
    }
    if (motorOwner == MOTOR_OWNER_NONE ||
        motorOwner == MOTOR_OWNER_AUTO)
    {
        auto_mode_background_control();
        if (autoActive && is_schedule_allowing_run())
            autoState = AUTO_ON_WAIT;
    }
    leds_from_model();
    Buzzer_Update();
}
DryFSMState ModelHandle_GetDryState(void)
{
    return dryState;
}
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();
    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;
    countdownDuration = 0;
    UART_SendStatusPacket();
}
void ModelHandle_SetUserSettings(uint32_t gap_seconds,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    if (gap_seconds > 86400UL)
        gap_seconds = 86400UL;
    sys.gap_time_s  = gap_seconds;
    sys.retry_count = retry;
    sys.uv_limit    = uv_limit;
    sys.ov_limit    = ov_limit;
    sys.overload    = (float)overload;
    sys.underload   = (float)underload;
    sys.maxrun_min  = maxrun_min;
    ModelHandle_SaveSettingsToEEPROM();
    if (autoActive)
    {
        uint32_t now = HAL_GetTick();
        uint32_t gapSec = (sys.gap_time_s == 0) ? 120 : sys.gap_time_s;
        autoDeadline = now + (gapSec * 1000UL);
    }
}

